### Adding a column  with Different ways

In [2]:
import pandas as pd

df = pd.DataFrame([
  [1, '3 inch screw', 0.5, 0.75],
  [2, '2 in nail', 0.10, 0.25],
  [3, 'HaMMer', 3.00, 5.50],
  [4, 'SCREWDRIVER', 2.50, 3.00]
],
  columns=['Product ID', 'Description', 'Cost to Manufacture', 'Price']
)
df

   Product ID   Description  Cost to Manufacture  Price
0           1  3 inch screw                  0.5   0.75
1           2     2 in nail                  0.1   0.25
2           3        HaMMer                  3.0   5.50
3           4   SCREWDRIVER                  2.5   3.00

In [63]:
# Add columns here --> METHOD 1
df['Sold in Bulk?'] = ['Yes', 'Yes', 'No', 'No']

In [64]:
df

   Product ID   Description  Cost to Manufacture  Price Sold in Bulk?
0           1  3 inch screw                  0.5   0.75           Yes
1           2     2 in nail                  0.1   0.25           Yes
2           3        HaMMer                  3.0   5.50            No
3           4   SCREWDRIVER                  2.5   3.00            No

In [65]:
# Add columns here --> METHOD 2
df['Is taxed?'] = 'Yes'

In [66]:
df

,Product ID,Description,Cost to Manufacture,Price,Sold in Bulk?,Is taxed?
0,1,3 inch screw,0.5,0.75,Yes,Yes
1,2,2 in nail,0.1,0.25,Yes,Yes
2,3,HaMMer,3.0,5.50,No,Yes
3,4,SCREWDRIVER,2.5,3.00,No,Yes

In [67]:
#add column here --> METHOD 3
df['Margin'] = df.Price - df['Cost to Manufacture']

In [68]:
df

,Product ID,Description,Cost to Manufacture,Price,Sold in Bulk?,Is taxed?,Margin
0,1,3 inch screw,0.5,0.75,Yes,Yes,0.25
1,2,2 in nail,0.1,0.25,Yes,Yes,0.15
2,3,HaMMer,3.0,5.50,No,Yes,2.50
3,4,SCREWDRIVER,2.5,3.00,No,Yes,0.50

### Applying Operation on column

In [69]:
from string import lower

df.Description.apply(lower) # error arises

ImportError: cannot import name 'lower' from 'string' (C:\Users\qasim\anaconda3\lib\string.py)

In [70]:
df.Description = df.Description.str.lower() # another way

In [71]:
df

,Product ID,Description,Cost to Manufacture,Price,Sold in Bulk?,Is taxed?,Margin
0,1,3 inch screw,0.5,0.75,Yes,Yes,0.25
1,2,2 in nail,0.1,0.25,Yes,Yes,0.15
2,3,hammer,3.0,5.50,No,Yes,2.50
3,4,screwdriver,2.5,3.00,No,Yes,0.50

In [72]:
df.Description = df.Description.str.upper()
df

,Product ID,Description,Cost to Manufacture,Price,Sold in Bulk?,Is taxed?,Margin
0,1,3 INCH SCREW,0.5,0.75,Yes,Yes,0.25
1,2,2 IN NAIL,0.1,0.25,Yes,Yes,0.15
2,3,HAMMER,3.0,5.50,No,Yes,2.50
3,4,SCREWDRIVER,2.5,3.00,No,Yes,0.50

In [73]:
df.Description = df.Description.str.title()
df

,Product ID,Description,Cost to Manufacture,Price,Sold in Bulk?,Is taxed?,Margin
0,1,3 Inch Screw,0.5,0.75,Yes,Yes,0.25
1,2,2 In Nail,0.1,0.25,Yes,Yes,0.15
2,3,Hammer,3.0,5.50,No,Yes,2.50
3,4,Screwdriver,2.5,3.00,No,Yes,0.50

In [74]:
df.reset_index(inplace = True,drop = True)
df

,Product ID,Description,Cost to Manufacture,Price,Sold in Bulk?,Is taxed?,Margin
0,1,3 Inch Screw,0.5,0.75,Yes,Yes,0.25
1,2,2 In Nail,0.1,0.25,Yes,Yes,0.15
2,3,Hammer,3.0,5.50,No,Yes,2.50
3,4,Screwdriver,2.5,3.00,No,Yes,0.50

### Reviewing Lambda Function

lambda x: [OUTCOME IF TRUE] if [CONDITIONAL] else [OUTCOME IF FALSE]

In [50]:
my_age = lambda x: x+11
print(my_age(10))

21

In [51]:
mylambda =  lambda x: x[0]+x[-1]
print(mylambda('This is a string'))

Tg

### Reviewing Lambda Function: If Statements

In [52]:
def myfunction(x): # NORMAL CODE
    if x > 40:
        return 40 + (x - 40) * 1.50
    else:
        return x

In [53]:
myfunction(41)

41.5

In [54]:
myfunction = lambda x: 40+(x-40)*1.50 if x>40 else x

In [55]:
myfunction(41)

41.5

In [56]:
mylambda = lambda x: 'Welcome to BattleCity!' if x >= 13 else 'You must be over 13'

print(mylambda(13))

Welcome to BattleCity!

### Applying a Lambda to a Column

In [6]:
df = pd.read_csv('employees.csv')

# Add columns here
get_last_name = lambda x : x.split()[1]
df.head(3)

      id               name  hourly_wage  hours_worked
0  10310      Lauren Durham           19            43
1  18656      Grace Sellers           17            40
2  61254  Shirley Rasmussen           16            30

In [7]:
df['last_name'] = df.name.apply(get_last_name)
df.head(3)

      id               name  hourly_wage  hours_worked  last_name
0  10310      Lauren Durham           19            43     Durham
1  18656      Grace Sellers           17            40    Sellers
2  61254  Shirley Rasmussen           16            30  Rasmussen

### Applying a Lambda to a Row

In [75]:
df['Price with Tax'] = df.apply(lambda row:row['Price'] * 1.075 if row['Is taxed?'] == 'Yes' else row['Price'],axis=1)

In [77]:
df

,Product ID,Description,Cost to Manufacture,Price,Sold in Bulk?,Is taxed?,Margin,Price with Tax
0,1,3 Inch Screw,0.5,0.75,Yes,Yes,0.25,0.80625
1,2,2 In Nail,0.1,0.25,Yes,Yes,0.15,0.26875
2,3,Hammer,3.0,5.50,No,Yes,2.50,5.91250
3,4,Screwdriver,2.5,3.00,No,Yes,0.50,3.22500

In [88]:
df2 = pd.read_csv('employees.csv')
df2.head(3)

      id               name  hourly_wage  hours_worked
0  10310      Lauren Durham           19            43
1  18656      Grace Sellers           17            40
2  61254  Shirley Rasmussen           16            30

If an employee worked for more than 40 hours, she needs to be paid overtime (1.5 times the normal hourly wage).

For instance, if an employee worked for 43 hours and made $10/hour, she would receive $400 for the first 40 hours that she worked, and an additional $45 for the 3 hours of overtime, for a total for $445.

Create a lambda function total_earned that accepts an input row with keys hours_worked and hourly_wage and uses an if statement to calculate the hourly wage.

In [83]:
total_earned  = lambda row: (40 * row['hourly_wage'])+ (row['hours_worked'] - 40) * (row['hourly_wage'] * 1.50) if row['hours_worked'] > 40 else row['hours_worked'] * row['hourly_wage']

In [85]:
df2['total_earned'] = df2.apply(total_earned, axis = 1)

In [87]:
df2.head(3)

      id               name  hourly_wage  hours_worked  total_earned
0  10310      Lauren Durham           19            43         845.5
1  18656      Grace Sellers           17            40         680.0
2  61254  Shirley Rasmussen           16            30         480.0

### Changing column names

In [8]:
# --> METHIOD 1

In [90]:
df2.columns

Index(['id', 'name', 'hourly_wage', 'hours_worked'], dtype='object')

In [92]:
df2.columns = ['id', 'f_name', 'hourly_wage', 'hours_worked']
df2.head(3)

      id             f_name  hourly_wage  hours_worked
0  10310      Lauren Durham           19            43
1  18656      Grace Sellers           17            40
2  61254  Shirley Rasmussen           16            30

In [94]:
df3 = pd.read_csv('imdb.csv')

# Rename columns here
df3.columns = ['ID', 'Title', 'Category', 'Year Released', 'Rating']

df3.head(3)

   ID           Title Category  Year Released  Rating
0   1          Avatar   action           2009     7.9
1   2  Jurassic World   action           2015     7.3
2   3    The Avengers   action           2012     8.1

In [9]:
# --> METHOD 2

In [99]:
df3.rename(columns = {'name' : 'movie_title'}, inplace = True)
df3.head(3)

   ID           Title Category  Year Released  Rating
0   1          Avatar   action           2009     7.9
1   2  Jurassic World   action           2015     7.3
2   3    The Avengers   action           2012     8.1

In [96]:
df = pd.DataFrame({
    'name': ['John', 'Jane', 'Sue', 'Fred'],
    'age': [23, 29, 21, 18]
})
df

   name  age
0  John   23
1  Jane   29
2   Sue   21
3  Fred   18

In [97]:
df.rename(columns={
    'name': 'First Name',
    'age': 'Age'},
    inplace=True)

df

  First Name  Age
0       John   23
1       Jane   29
2        Sue   21
3       Fred   18

### Practice

In [24]:
import pandas as pd

In [25]:
inventory = pd.read_csv('inventory.csv')
inventory.head(10)

        location  product_type         product_description  quantity  price
0  Staten Island         seeds                       daisy         4   6.99
1  Staten Island         seeds                  calla lily        46  19.99
2  Staten Island         seeds                      tomato        85  13.99
3  Staten Island  garden tools                        rake         4  13.99
4  Staten Island  garden tools                 wheelbarrow         0  89.99
5  Staten Island  garden tools                       spade        93  19.99
6  Staten Island  pest_control               insect killer        74  12.99
7  Staten Island  pest_control                 weed killer         8  23.99
8  Staten Island       planter  20 inch terracotta planter         0  17.99
9  Staten Island       planter      8 inch plastic planter        53   3.99

In [27]:
staten_island = inventory.iloc[:10] # first ten rows

In [28]:
product_request = staten_island.product_description

In [29]:
seed_request = inventory[(inventory.location == 'Brooklyn') & (inventory.product_type == 'seeds')]

In [31]:
inventory['in_stock'] = inventory.quantity.apply(lambda x: True if x > 0 else False)
inventory.head(3)

        location product_type product_description  quantity  price  in_stock
0  Staten Island        seeds               daisy         4   6.99      True
1  Staten Island        seeds          calla lily        46  19.99      True
2  Staten Island        seeds              tomato        85  13.99      True

In [33]:
inventory ['total_quality'] = inventory.price * inventory.quantity

inventory.head(3)

,location,product_type,product_description,quantity,price,in_stock,total_quality
0,Staten Island,seeds,daisy,4,6.99,True,27.96
1,Staten Island,seeds,calla lily,46,19.99,True,919.54
2,Staten Island,seeds,tomato,85,13.99,True,1189.15

In [36]:
combine_lambda = lambda row :'{} - {}'.format(row.product_type, row.product_description)

inventory['full_description'] = inventory.apply(combine_lambda, axis = 1)

inventory.head(3)

,location,product_type,product_description,quantity,price,in_stock,total_quality,full_description
0,Staten Island,seeds,daisy,4,6.99,True,27.96,seeds - daisy
1,Staten Island,seeds,calla lily,46,19.99,True,919.54,seeds - calla lily
2,Staten Island,seeds,tomato,85,13.99,True,1189.15,seeds - tomato